zsh-users/zsh-autosuggestions kind:zsh


belak/zsh-utils path:completion
zsh-users/zsh-syntax-highlighting kind:zsh
zsh-users/zsh-history-substring-search kind:zsh

mattmc3/zephyr path:plugins/color
mattmc3/zephyr path:plugins/completion
# mattmc3/zephyr path:plugins/confd
mattmc3/zephyr path:plugins/directory
mattmc3/zephyr path:plugins/editor
mattmc3/zephyr path:plugins/environment
mattmc3/zephyr path:plugins/history
mattmc3/zephyr path:plugins/homebrew
mattmc3/zephyr path:plugins/macos
mattmc3/zephyr path:plugins/prompt
mattmc3/zephyr path:plugins/utility
mattmc3/zephyr path:plugins/zfunctions

# https://www.reddit.com/r/terminal_porn/comments/zqlbhm/comment/j0zgf1b/
agkozak/zsh-z
Aloxaf/fzf-tab
mdumitru/fancy-ctrl-z
unixorn/prettyping
# huboles/zshmux

# recommended from antidote: https://antidote.sh/#plugins-file
# Basic Zsh plugins are defined in user/repo format
# jeffreytse/zsh-vi-mode

# Bash plugins may also work
rupa/z

# annotations are also allowed:
romkatv/zsh-bench kind:path
olets/zsh-abbr    kind:defer

# set up Zsh completions with plugins
mattmc3/ez-compinit
zsh-users/zsh-completions kind:fpath path:src

# frameworks like oh-my-zsh are supported
getantidote/use-omz        # handle OMZ dependencies
ohmyzsh/ohmyzsh path:lib   # load OMZ's library
ohmyzsh/ohmyzsh path:plugins/colored-man-pages  # load OMZ plugins
ohmyzsh/ohmyzsh path:plugins/magic-enter

# # or lighter-weight ones like zsh-utils
# belak/zsh-utils path:history
# belak/zsh-utils path:editor
# belak/zsh-utils path:prompt
# belak/zsh-utils path:utility

# popular fish-like plugins
mattmc3/zfunctions
zsh-users/zsh-autosuggestions
zdharma-continuum/fast-syntax-highlighting kind:defer
zsh-users/zsh-history-substring-search

ohmyzsh/ohmyzsh path:lib/history.zsh
ohmyzsh/ohmyzsh path:plugins/magic-enter
ohmyzsh/ohmyzsh path:plugins/extract