mattmc3/zephyr path:plugins/color
mattmc3/zephyr path:plugins/completion
# mattmc3/zephyr path:plugins/confd
mattmc3/zephyr path:plugins/directory
mattmc3/zephyr path:plugins/editor
mattmc3/zephyr path:plugins/environment
mattmc3/zephyr path:plugins/history
mattmc3/zephyr path:plugins/homebrew
mattmc3/zephyr path:plugins/macos
mattmc3/zephyr path:plugins/prompt
mattmc3/zephyr path:plugins/utility
mattmc3/zephyr path:plugins/zfunctions

belak/zsh-utils path:completion

# https://www.reddit.com/r/terminal_porn/comments/zqlbhm/comment/j0zgf1b/
zdharma-continuum/fast-syntax-highlighting kind:zsh # = zsh-users/zsh-syntax-highlighting
zsh-users/zsh-history-substring-search kind:zsh
agkozak/zsh-z
# Aloxaf/fzf-tab
mdumitru/fancy-ctrl-z
unixorn/prettyping
# huboles/zshmux

# recommended from antidote: https://antidote.sh/#plugins-file
# Basic Zsh plugins are defined in user/repo format
# jeffreytse/zsh-vi-mode

# Bash plugins may also work
# rupa/z

# annotations are also allowed:
# romkatv/zsh-bench kind:path
olets/zsh-abbr kind:defer

# frameworks like oh-my-zsh are supported
getantidote/use-omz        # handle OMZ dependencies
ohmyzsh/ohmyzsh path:lib   # load OMZ's library
ohmyzsh/ohmyzsh path:plugins/colored-man-pages  # load OMZ plugins
ohmyzsh/ohmyzsh path:plugins/magic-enter
ohmyzsh/ohmyzsh path:lib/history.zsh
ohmyzsh/ohmyzsh path:plugins/extract
ohmyzsh/ohmyzsh path:plugins/docker
ohmyzsh/ohmyzsh path:plugins/fzf
# ohmyzsh/ohmyzsh path:plugins/aws

# set up Zsh completions with plugins https://github.com/unixorn/awesome-zsh-plugins?tab=readme-ov-file#completions
zsh-users/zsh-autosuggestions kind:zsh
mattmc3/ez-compinit
zsh-users/zsh-completions path:src kind:fpath
eastokes/aws-plugin-zsh
sudosubin/zsh-github-cli
# bonnefoa/kubectl-fzf kind:zsh

# # or lighter-weight ones like zsh-utils
# belak/zsh-utils path:history
# belak/zsh-utils path:editor
# belak/zsh-utils path:prompt
# belak/zsh-utils path:utility

# popular fish-like plugins
mattmc3/zfunctions
