tap "databricks/tap"
tap "sdkman/tap"
brew "openssl@3"
brew "ansible"
brew "antidote"
brew "aws-sam-cli"
brew "aws-sso-cli"
brew "awscli"
brew "btop"
brew "cookiecutter"
brew "coreutils"
brew "docker"
brew "fd"
brew "fnm"
brew "fzf"
brew "gh"
brew "gnu-sed"
brew "go"
brew "gradle"
brew "gtree"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "lazygit"
brew "pre-commit"
brew "pyenv"
brew "ripgrep"
brew "rustup"
brew "shyaml"
brew "starship"
brew "tealdeer"
brew "tenv"
brew "terraform-docs"
brew "tig"
brew "tree"
brew "uv"
brew "yadm"
brew "databricks/tap/databricks"
brew "sdkman/tap/sdkman-cli"
cask "cookie"
cask "font-anonymice-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-fira-mono-nerd-font"
cask "iterm2"
cask "keycastr"
cask "monitorcontrol"
cask "notion"
cask "raycast"
cask "rectangle"
cask "spotify"
cask "unnaturalscrollwheels"
cask "visual-studio-code"
vscode "akamud.vscode-theme-onelight"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "johnpapa.read-time"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.wordcount"
vscode "ms-vsliveshare.vsliveshare"
vscode "pomdtr.excalidraw-editor"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "stuart.unique-window-colors"
vscode "tamasfe.even-better-toml"
