brew "antidote"
brew "aws-sso-cli"
brew "awscli"
brew "btop"
brew "fd"
brew "lazygit"
brew "ripgrep"
brew "starship"
brew "tealdeer"
brew "tig"
brew "tmux"
brew "yadm"
cask "font-anonymice-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-fira-mono-nerd-font"
cask "iterm2"
cask "monitorcontrol"
cask "notion"
cask "raycast"
cask "rectangle"
cask "spotify"
cask "visual-studio-code"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vsliveshare.vsliveshare"
vscode "stuart.unique-window-colors"
vscode "tamasfe.even-better-toml"
